/****************************************************************************
Copyright (C) 2013 Telechips Inc.

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
****************************************************************************/
 
#include <stdio.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <sys/ioctl.h>
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "edid.h"
#include "libedid.h"
#include "libddc/libddc.h"

#define EDID_DEBUG      1
#define LOG_TAG "LIBEDID"
#include <utils/Log.h>

#if EDID_DEBUG
#define DPRINTF(args...)    ALOGD(args)
#else
#define DPRINTF(args...)
#endif

#if 0
#define FPRINTF(args...)    ALOGI(args)
#else
#define FPRINTF(args...)
#endif

#define MSGPRT(cond,printf_exp) ( (cond)?(ALOGD printf_exp):(EDID_DEBUG?(ALOGD printf_exp):0))
/**
 * @var gEdidData
 * Pointer to EDID data
 */
static unsigned char* gEdidData=NULL;

/**
 * @var gExtensions
 * Number of EDID extensions
 */
static int gExtensions;

#define EDID_CHK_LENGTH		32

//! Structure for parsing video timing parameter in EDID
static const struct edid_params
{
#if (1) || defined(TELECHIPS)
	unsigned int supported;
#endif
    /** H Blank */
    unsigned int vHBlank;
    /** V Blank */
    unsigned int vVBlank;
    /**
     * H Total + V Total @n
     * For more information, refer HDMI register map
     */
    unsigned int vHVLine;
    /** CEA VIC */
    unsigned char  VIC;
    /** CEA VIC for 16:9 aspect ratio */
    unsigned char  VIC16_9;
    /** 0 if progressive, 1 if interlaced */
    unsigned char  interlaced;
    /** Pixel frequency */
    enum PixelFreq PixelClock;
} aVideoParams[] =
{
    { 1, 0xA0 , 0x16A0D, 0x32020D,  1 , 1 , 0, PIXEL_FREQ_25_200,  },  // v640x480p_60Hz
    { 1, 0x8A , 0x16A0D, 0x35A20D,  2 , 3 , 0, PIXEL_FREQ_27_027,  },  // v720x480p_60Hz
	#if defined(HDMI_V1_4) //MVC_PROCESS
	{ 1, 0x172, 0xF2EE , 0x6722EE,  4 , 4 , 0, PIXEL_FREQ_74_250,  },	    // v1280x720p_60Hz_3D
	#endif
    { 1, 0x172, 0xF2EE , 0x6722EE,  4 , 4 , 0, PIXEL_FREQ_74_250,  },  // v1280x720p_60Hz
    { 1, 0x118, 0xB232 , 0x898465,  5 , 5 , 1, PIXEL_FREQ_74_250,  },  // v1920x1080i_60Hz
    { 1, 0x114, 0xB106 , 0x6B420D,  6 , 7 , 1, PIXEL_FREQ_27_027,  },  // v720x480i_60Hz
    { 0, 0x114, 0xB106 , 0x6B4106,  8 , 9 , 0, PIXEL_FREQ_27_027,  },  // v720x240p_60Hz
    { 0, 0x228, 0xB106 , 0xD6820D,  10, 11, 1, PIXEL_FREQ_54_054,  },  // v2880x480i_60Hz
    { 0, 0x228, 0xB106 , 0x6B4106,  12, 13, 0, PIXEL_FREQ_54_054,  },  // v2880x240p_60Hz
    { 0, 0x114, 0x16A0D, 0x6B420D,  14, 15, 0, PIXEL_FREQ_54_054,  },  // v1440x480p_60Hz
    { 1, 0x118, 0x16C65, 0x898465,  16, 16, 0, PIXEL_FREQ_148_500, },  // v1920x1080p_60Hz
    { 1, 0x90 , 0x18A71, 0x360271,  17, 18, 0, PIXEL_FREQ_27,      },  // v720x576p_50Hz
    { 1, 0x2BC, 0xF2EE , 0x7BC2EE,  19, 19, 0, PIXEL_FREQ_74_250,  },  // v1280x720p_50Hz
    { 1, 0x2D0, 0xB232 , 0xA50465,  20, 20, 1, PIXEL_FREQ_74_250,  },  // v1920x1080i_50Hz
    { 1, 0x120, 0xC138 , 0x6C0271,  21, 22, 1, PIXEL_FREQ_27,      },  // v720x576i_50Hz
    { 0, 0x120, 0xC138 , 0x6C0138,  23, 24, 0, PIXEL_FREQ_27,      },  // v720x288p_50Hz
    { 0, 0x240, 0xC138 , 0xD80271,  25, 26, 1, PIXEL_FREQ_54,      },  // v2880x576i_50Hz
    { 0, 0x240, 0xC138 , 0xD80138,  27, 28, 0, PIXEL_FREQ_54,      },  // v2880x288p_50Hz
    { 0, 0x120, 0x18A71, 0x6C0271,  29, 30, 0, PIXEL_FREQ_54,      },  // v1440x576p_50Hz
    { 1, 0x2D0, 0x16C65, 0xA50465,  31, 31, 0, PIXEL_FREQ_148_500, },  // v1920x1080p_50Hz
    #if defined(HDMI_V1_4) //MVC_PROCESS
    { 0, 0x33E, 0x16C65, 0xABE465,  32, 32, 0, PIXEL_FREQ_74_250,  },  // v1920x1080p_24Hz_3D
    #endif
    { 0, 0x33E, 0x16C65, 0xABE465,  32, 32, 0, PIXEL_FREQ_74_250,  },  // v1920x1080p_24Hz
    { 0, 0x2D0, 0x16C65, 0xA50465,  33, 33, 0, PIXEL_FREQ_74_250,  },  // v1920x1080p_25Hz
    { 0, 0x2D0, 0x16C65, 0xA50465,  34, 34, 0, PIXEL_FREQ_74_250,  },  // v1920x1080p_30Hz
    { 0, 0x228, 0x16A0D, 0xD6820D,  35, 36, 0, PIXEL_FREQ_108_108, },  // v2880x480p_60Hz
    { 0, 0x240, 0x18A71, 0xD80271,  37, 38, 0, PIXEL_FREQ_108,     },  // v2880x576p_50Hz
    { 1, 0x180, 0x2AA71, 0x9004E2,  39, 39, 0, PIXEL_FREQ_72,      },  // v1920x1080i_50Hz(1250)
    { 0, 0x2D0, 0xB232 , 0xA50465,  40, 40, 1, PIXEL_FREQ_148_500, },  // v1920x1080i_100Hz
    { 0, 0x2BC, 0xF2EE , 0x7BC2EE,  41, 41, 0, PIXEL_FREQ_148_500, },  // v1280x720p_100Hz
    { 0, 0x90 , 0x18A71, 0x360271,  42, 43, 0, PIXEL_FREQ_54,      },  // v720x576p_100Hz
    { 0, 0x120, 0xC138 , 0x6C0271,  44, 45, 1, PIXEL_FREQ_54,      },  // v720x576i_100Hz
    { 0, 0x118, 0xB232 , 0x898465,  46, 46, 1, PIXEL_FREQ_148_500, },  // v1920x1080i_120Hz
    { 0, 0x172, 0xF2EE , 0x6722EE,  47, 47, 0, PIXEL_FREQ_148_500, },  // v1280x720p_120Hz
    { 0, 0x8A , 0x16A0D, 0x35A20D,  48, 49, 0, PIXEL_FREQ_54_054,  },  // v720x480p_120Hz
    { 0, 0x114, 0xB106 , 0x6B420D,  50, 51, 1, PIXEL_FREQ_54_054,  },  // v720x480i_120Hz
    { 0, 0x90 , 0x18A71, 0x360271,  52, 53, 0, PIXEL_FREQ_108,     },  // v720x576p_200Hz
    { 0, 0x120, 0xC138 , 0x6C0271,  54, 55, 1, PIXEL_FREQ_108,     },  // v720x576i_200Hz
    { 0, 0x8A , 0x16A0D, 0x35A20D,  56, 57, 0, PIXEL_FREQ_108_108, },  // v720x480p_240Hz
    { 0, 0x114, 0xB106 , 0x6B420D,  58, 59, 1, PIXEL_FREQ_108_108, },  // v720x480i_240Hz
};

#define NONDTD 0x0
#define DBCCOLLECTION 0x1
#define DTDCOLLECTION 0x2
unsigned char* pStandardResTiming[] = {
    (unsigned char*)(""),
    (unsigned char*)("01 DMT0659   4:3                640x480p @  60Hz"),
    (unsigned char*)("02 480p      4:3                720x480p @  60Hz"),
    (unsigned char*)("03 480pH    16:9                720x480p @  60Hz"),
    #if defined(HDMI_V1_4) //MVC_PROCESS
    (unsigned char*)("04 720p     16:9               1280x720p @  60Hz"),
    #endif
    (unsigned char*)("04 720p     16:9               1280x720p @  60Hz"),
    (unsigned char*)("05 1080i    16:9              1920x1080i @  60Hz"),
    (unsigned char*)("06 480i      4:3          720(1440)x480i @  60Hz"),
    (unsigned char*)("07 480iH    16:9          720(1440)x480i @  60Hz"),
    (unsigned char*)("08 240p      4:3          720(1440)x240p @  60Hz"),
    (unsigned char*)("09 240pH    16:9          720(1440)x240p @  60Hz"),
    (unsigned char*)("10 480i4x    4:3             (2880)x480i @  60Hz"),
    (unsigned char*)("11 480i4xH  16:9             (2880)x480i @  60Hz"),
    (unsigned char*)("12 240p4x    4:3             (2880)x240p @  60Hz"),
    (unsigned char*)("13 240p4xH  16:9             (2880)x240p @  60Hz"),
    (unsigned char*)("14 480p2x    4:3               1440x480p @  60Hz"),
    (unsigned char*)("15 480p2xH  16:9               1440x480p @  60Hz"),
    (unsigned char*)("16 1080p    16:9              1920x1080p @  60Hz"),
    (unsigned char*)("17 576p      4:3                720x576p @  50Hz"),
    (unsigned char*)("18 576pH    16:9                720x576p @  50Hz"),
    (unsigned char*)("19 720p50   16:9               1280x720p @  50Hz"),
    (unsigned char*)("20 1080i25  16:9              1920x1080i @  50Hz"),
    (unsigned char*)("21 576i      4:3          720(1440)x576i @  50Hz"),
    (unsigned char*)("22 576iH    16:9          720(1440)x576i @  50Hz"),
    (unsigned char*)("23 288p      4:3          720(1440)x288p @  50Hz"),
    (unsigned char*)("24 288pH    16:9          720(1440)x288p @  50Hz"),
    (unsigned char*)("25 576i4x    4:3             (2880)x576i @  50Hz"),
    (unsigned char*)("26 576i4xH  16:9             (2880)x576i @  50Hz"),
    (unsigned char*)("27 288p4x    4:3             (2880)x288p @  50Hz"),
    (unsigned char*)("28 288p4xH  16:9             (2880)x288p @  50Hz"),
    (unsigned char*)("29 576p2x    4:3               1440x576p @  50Hz"),
    (unsigned char*)("30 576p2xH  16:9               1440x576p @  50Hz"),
    (unsigned char*)("31 1080p50  16:9              1920x1080p @  50Hz"),
    #if defined(HDMI_V1_4) //MVC_PROCESS
    (unsigned char*)("32 1080p24  16:9              1920x1080p @  24Hz"),
    #endif
    (unsigned char*)("32 1080p24  16:9              1920x1080p @  24Hz"),
    (unsigned char*)("33 1080p25  16:9              1920x1080p @  25Hz"),
    (unsigned char*)("34 1080p30  16:9              1920x1080p @  30Hz"),
    (unsigned char*)("35 480p4x    4:3             (2880)x480p @  60Hz"),
    (unsigned char*)("36 480p4xH  16:9             (2880)x480p @  60Hz"),
    (unsigned char*)("37 576p4x    4:3             (2880)x576p @  50Hz"),
    (unsigned char*)("38 576p4xH  16:9             (2880)x576p @  50Hz"),
    (unsigned char*)("39 108Oi25  16:9  1920x1080i(1250 Total) @  50Hz"),
    (unsigned char*)("40 1080i50  16:9              1920x1080i @ 100Hz"),
    (unsigned char*)("41 720p100  16:9               1280x720p @ 100Hz"),
    (unsigned char*)("42 576p100   4:3                720x576p @ 100Hz"),
    (unsigned char*)("43 576p100H 16:9                720x576p @ 100Hz"),
    (unsigned char*)("44 576i50    4:3          720(1440)x576i @ 100Hz"),
    (unsigned char*)("45 576i50H  16:9          720(1440)x576i @ 100Hz"),
    (unsigned char*)("46 1080i60  16:9              1920x1080i @ 120Hz"),
    (unsigned char*)("47 720p120  16:9               1280x720p @ 120Hz"),
    (unsigned char*)("48 480p119   4:3                720x480p @ 120Hz"),
    (unsigned char*)("49 480p119H 16:9                720x480p @ 120Hz"),
    (unsigned char*)("50 480i59    4:3          720(1440)x480i @ 120Hz"),
    (unsigned char*)("51 480i59H  16:9          720(1440)x480i @ 120Hz"),
    (unsigned char*)("52 576p200   4:3                720x576p @ 200Hz"),
    (unsigned char*)("53 576p200H 16:9                720x576p @ 200Hz"),
    (unsigned char*)("54 576i100   4:3          720(1440)x576i @ 200Hz"),
    (unsigned char*)("55 576i100H 16:9          720(1440)x576i @ 200Hz"),
    (unsigned char*)("56 480p239   4:3                720x480p @ 240Hz"),
    (unsigned char*)("57 480p239H 16:9                720x480p @ 240Hz"),
    (unsigned char*)("58 480i119   4:3          720(1440)x480i @ 240Hz"),
    (unsigned char*)("59 480i119H 16:9          720(1440)x480i @ 240Hz"),
    (unsigned char*)("60 720p24   16:9               1280x720p @  24Hz"),
    (unsigned char*)("61 720p25   16:9               1280x720p @  25Hz"),
    (unsigned char*)("62 720p30   16:9               1280x720p @  30Hz"),
    (unsigned char*)("63 1080p120 16:9               1920x1080 @ 120Hz")
};

unsigned char* pAudioFormat[] = {
    (unsigned char*)"0 = Reserved", 
    (unsigned char*)"1 = Linear Pulse Code Modulation (LPCM)",
    (unsigned char*)"2 = AC-3",
    (unsigned char*)"3 = MPEG1 (Layers 1 and 2)",
    (unsigned char*)"4 = MP3",
    (unsigned char*)"5 = MPEG2",
    (unsigned char*)"6 = AAC",
    (unsigned char*)"7 = DTS",
    (unsigned char*)"8 = ATRAC",
    (unsigned char*)"9 = One-bit audio aka SACD",
    (unsigned char*)"10 = DD+",
    (unsigned char*)"11 = DTS-HD",
    (unsigned char*)"12 = MLP/Dolby TrueHD",
    (unsigned char*)"13 = DST Audio",
    (unsigned char*)"14 = Microsoft WMA Pro",
    (unsigned char*)"15 = Reserved"
};

unsigned char* pADChannel[] = {
    (unsigned char*)"1 Channel",
    (unsigned char*)"2 Channel",
    (unsigned char*)"3 Channel",
    (unsigned char*)"4 Channel",
    (unsigned char*)"5 Channel",
    (unsigned char*)"6 Channel",
    (unsigned char*)"7 Channel",
    (unsigned char*)"8 Channel"
};
    
unsigned char* pSampleFreq[] = {
    (unsigned char*)"32kHz",
    (unsigned char*)"44kHz",
    (unsigned char*)"48kHz",    
    (unsigned char*)"88kHz",
    (unsigned char*)"96kHz",
    (unsigned char*)"176kHz",
    (unsigned char*)"192kHz"
};

unsigned char* pBitrate[] = {
	(unsigned char*)"16Bit",
	(unsigned char*)"20Bit",
	(unsigned char*)"24Bit"
};

unsigned char* pEstablishedTiming[] = {
    (unsigned char*)"800x600@60Hz",
    (unsigned char*)"800x600@56Hz",
    (unsigned char*)"640x480@75Hz",
    (unsigned char*)"640x480@72Hz",
    (unsigned char*)"640x480@67Hz",
    (unsigned char*)"640x480@60Hz",
    (unsigned char*)"720x400@88Hz",
    (unsigned char*)"720x400@70Hz",
    (unsigned char*)"1280x1024@75Hz",
    (unsigned char*)"1024x678@75Hz",
    (unsigned char*)"1024x768@70Hz",
    (unsigned char*)"1024x768@60Hz",
    (unsigned char*)"1024x768@87Hz(I)",
    (unsigned char*)"832x624@75Hz",
    (unsigned char*)"800x600@75Hz",
    (unsigned char*)"800x600@72Hz"
};


unsigned char* pBlockType[]={
    (unsigned char*)"Monitor Serial Number",
    (unsigned char*)"ASCII String",
    (unsigned char*)"Monitor Range Limits",
    (unsigned char*)"Monitor Name",
    (unsigned char*)"Color Point Data",
    (unsigned char*)"Standard Timing Data",
    (unsigned char*)"Currently Undefined",
    (unsigned char*)"Defined by Manufacturer"
};
#if !defined(_LINUX_)
#pragma pack(1)
#endif
typedef union _DTV{
    unsigned char DTVInfo;
    struct
    {
        unsigned char NativeFormatNum:4;
        unsigned char YCbCr422:1;
        unsigned char YCbCr444:1;
        unsigned char basicaudio:1;
        unsigned char underscan:1;
    }B;
#if defined(_LINUX_)
}__attribute__ ((packed)) stDTV;
#else
}stDTV;
#endif

typedef union _DBC{
    unsigned char DataBlockCollection;
    struct
    {
        unsigned char ByteNumber:5;
        unsigned char BlockType:3;
    }B;

#if defined(_LINUX_)
}__attribute__ ((packed)) stDBC;
#else
}stDBC;
#endif

typedef struct _stEEDID{
    unsigned char ExtensionTag;
    unsigned char RevisionNumber;
    unsigned char DTDs;
    stDTV   DTVInfo;
    //stDBC   BlockHead;

#if defined(_LINUX_)
}__attribute__ ((packed)) stEEDID;
#else
}stEEDID;
#endif

typedef union _SVD{
    unsigned char svd;
    struct{
        unsigned char index:7;
        unsigned char native:1;
    }B;

#if defined(_LINUX_)
}__attribute__ ((packed)) SVD;
#else
}SVD;
#endif

typedef struct _stVDB{
    stDBC   BlockHead;
    //unsigned char NumOfDscrpt;
    SVD ShortVideoDscrpt[18];

#if defined(_LINUX_)
}__attribute__ ((packed)) stVDB;
#else
}stVDB;
#endif

typedef union _SAD{
    struct{
        unsigned char channelnum:3;
        unsigned char audioformat:4;
        unsigned char reserved:1;
    }sadb1;

    struct{
        unsigned char samplefreq:7;
        unsigned char reserved:1;
    }sadb2;

    struct{
        unsigned char bitrate:3;
        unsigned char reserved:5;
    }sadb3;
    unsigned char sadb3a;

#if defined(_LINUX_)
}__attribute__ ((packed)) SAD;
#else
}SAD;
#endif

typedef struct _stADB{
    stDBC BlockHead;
    SAD SADB[3];

#if defined(_LINUX_)
}__attribute__ ((packed)) stADB;
#else
}stADB;
#endif

typedef union _CRSINK{
    unsigned char crsink;
    struct {
        unsigned char DVIDual:1;
        unsigned char reserved:2;
        unsigned char ycbcr444:1;
        unsigned char dc30bpp:1;
        unsigned char dc36bpp:1;
        unsigned char dc48bpp:1;
        unsigned char AIsupport:1;
    }B;
    
#if defined(_LINUX_)
}__attribute__ ((packed)) CRSINK;
#else
}CRSINK;
#endif

typedef union _LATENCY{
    unsigned char Latency;
    struct{
        unsigned char reserved:6;
        unsigned char ilatencyfield:1;
        unsigned char latencyfield:1;
    }B;
        
#if defined(_LINUX_)
}__attribute__ ((packed)) LATENCY;
#else
}LATENCY;
#endif

typedef union _PHYADR{
    unsigned char PhysicalAddr;
    struct{
        unsigned char high:4;
        unsigned char low:4;
    }B;
    
#if defined(_LINUX_)
}__attribute__ ((packed)) PHYADR;
#else
}PHYADR;
#endif

typedef union _STRUCT_3D{
    unsigned char Struct_3D;
    struct{
		unsigned char reserved:6;
        unsigned char Image_Size:2;
        unsigned char multi_present_3d:2;
        unsigned char present_3d:1;
    }B;
        
#if defined(_LINUX_)
}__attribute__ ((packed)) STRUCT_3D;
#else
}STRUCT_3D;
#endif

typedef union _VIC_3D_LEN{
    unsigned char VIC_3D_len;
    struct{
        unsigned char hdmi_3d_len:6;
        unsigned char hdmi_vic_len:6;
    }B;
        
#if defined(_LINUX_)
}__attribute__ ((packed)) VIC_3D_LEN;
#else
}VIC_3D_LEN;
#endif

typedef struct _stVSDB{
    stDBC BlockHead;
    unsigned char ieeeregid[3];
    PHYADR cpntphysaddr[2];
    CRSINK colorsink;
    unsigned char tmdsfreq;
    LATENCY latency;
    unsigned char videolatency;
    unsigned char audiolatency;
    unsigned char interlacedvideolatency;
    unsigned char interlacedaudiolatency;
	STRUCT_3D struct_3d;
	VIC_3D_LEN vic_3d_len;

#if defined(_LINUX_)
}__attribute__ ((packed)) stVSDB;
#else
}stVSDB;
#endif

typedef union _SPKLOC{
    unsigned char spkloacation;
    struct{
        unsigned char frntLR:1;
        unsigned char LFE:1;
        unsigned char frntCtr:1;
        unsigned char rearLR:1;
        unsigned char rearCtr:1;
        unsigned char frntLCRC:1;
        unsigned char rearLCRC:1;
        unsigned char reserved:1;
    }B; 

#if defined(_LINUX_)
}__attribute__ ((packed)) SPKLOC;
#else
}SPKLOC;
#endif

typedef struct _stSPK{
    stDBC BlockHead;
    SPKLOC  SpkLocation;
    unsigned char Byte2nd;
    unsigned char Byte3rd;

#if defined(_LINUX_)
}__attribute__ ((packed)) stSPK;
#else
}stSPK;
#endif

typedef struct _stCEABlock{
    stEEDID CEAInfo;
    stVDB   VDB;
    stADB   ADB;
    stVSDB  VSDB;
    stSPK   SPK;
    unsigned char NumofDTDs;

#if defined(_LINUX_)
}__attribute__ ((packed)) stCEABlock;
#else
}stCEABlock;
#endif




typedef struct _stPDBlock{
    unsigned short  pixelclock;// 10Khz unit
    unsigned char   HActive; // in pixel
    unsigned char   HBlanking; // in pixel
    union{
        unsigned char HABhigh;
        struct{
            unsigned char HBlankinghigh:4;
            unsigned char HActivehigh:4;
        }B;
    }HHigh;
    unsigned char   VActive;
    unsigned char   VBlanking;

    union{
        unsigned char VABhigh;
        struct{
            unsigned char VBlankinghigh:4;
            unsigned char VActivehigh:4;
        }B;
    }VHigh;

    unsigned char   HSyncOffset;        //in pixel
    unsigned char   HSyncPulsewidth;   //in pixel

    union{
        unsigned char VerticalSync;
        struct{
            unsigned char VSyncPulsewidth:4;
            unsigned char VSyncOffset:4;
        }B;
    }VSync;

    union{
        unsigned char MSBit;
        struct{
            unsigned char VSyncPulsewidthHSB:2;
            unsigned char VSyncOffsetHSB:2;
            unsigned char HSyncPulsewidthHSB:2;
            unsigned char HSyncOffsetHSB:2;
        }B;
    }HSB;

    unsigned char   Himagesize; //in mm
    unsigned char   Vimagesize; //in mm

    union{
        unsigned char Imgszhsb;
        struct{
            unsigned char VImgszHSB:4;
            unsigned char HImgszHSB:4;
        }B;
    }HSBIMGSize;

    unsigned char   HBoarder;
    unsigned char   VBoarder;

    union{
        unsigned char   modebit;
        struct{
            unsigned char Stereomode:1;
            unsigned char HSyncpositive:1;
            unsigned char VSyncpositive:1;
            unsigned char SeperateSync:2;
            unsigned char Stereo:2;
            unsigned char Interlaced:1;
        }B;
    }MODE;

#if defined(_LINUX_)
}__attribute__ ((packed)) stPDBlock;
#else
}stPDBlock;
#endif

typedef struct _stNPDBlock{
    unsigned short PixelClock;
    unsigned char reserved1;
    unsigned char BlockType;
    unsigned char reserved2;
    
    union{
    unsigned char BlockContents[13];    
        

        struct{
            unsigned char MinVFreq;//59
            unsigned char MaxVFreq;//60
            unsigned char MinHFreq;//61
            unsigned char MaxHFreq;//62
            unsigned char Pxlclk;//63
            unsigned short ScndGTF;//64 65
            unsigned char StrtHFreq; //66
            unsigned char C; //67
            unsigned short M; //68 69
            unsigned char K; //70
            unsigned char J; //71
        }FD000A;


        struct{
            unsigned char reseved1;//59
            unsigned char reseved2;//60
            unsigned char reseved3;//61
            unsigned char reseved4;//62
            unsigned char reseved5;//63
            unsigned short ScndGTF;//64 65
            unsigned char StrtHFreq;//66
            unsigned char MinVFreq;//67
            unsigned char MaxVFreq;//68
            unsigned char MinHFreq;//69
            unsigned char MaxHFreq;//70
            unsigned char Pxlclk;//71
        }FD0200;

        struct{
            unsigned char Windex0;// 59
            unsigned char WB0notuse;//60
            unsigned char WB0WX; //61
            unsigned char WB0WY; //62
            unsigned char WB0gamma;//63
                        
            unsigned char Windex1;// 64
			union{
                unsigned char wlsb; //65
				struct{
					unsigned char whiteY:2;
					unsigned char whiteX:2;
					unsigned char reserved:4;
				}BO;
			}WB1lsb;

            unsigned char WB1WX; //66
            unsigned char WB1WY; //67
            unsigned char WB1gamma;//68
            unsigned char reseved[3];//69 70 71
        }FB;

        struct{
            struct{
                unsigned char Hresolution;
                struct{
                    unsigned char VFreq:6;
                    unsigned char AspectRatio:2;
                }B;
            }STDTMG[6];
            unsigned char reserved;
        }FA;
        
    }NPDB;

#if defined(_LINUX_)
}__attribute__ ((packed)) stNPDBlock;
#else
}stNPDBlock;
#endif


//EDID Data Format
typedef struct _stEDID{

    // HEADER INFOMATION
    unsigned char   HeaderInfo[8];
    union{
    unsigned short  ManufacturerID; 
        struct{
            unsigned short byte3rd:5;
            unsigned short byte2nd:5;
            unsigned short byte1st:5;
            unsigned short reserved:1;
        }B;
    }MANUID;
    
    unsigned short  ProductID;
    unsigned int    SerialNum;
    unsigned char   Week;
    unsigned char   Year;
    unsigned char   EDIDVersion;
